<div class="row">
        <div class="col-lg-9">
            <h1>603.Consecutive Available Seats</h1>
            <div class="markdown-body" style="margin-top: 20px">
                Several friends at a cinema ticket office would like to reserve consecutive available seats.<br />
Can you help to query all the consecutive available seats order by the seat_id using the following <code>cinema</code> table?
<pre>
| seat_id | free |
|---------|------|
| 1       | 1    |
| 2       | 0    |
| 3       | 1    |
| 4       | 1    |
| 5       | 1    |
</pre>

<p>&nbsp;</p>
Your query should return the following result for the sample case above.

<p>&nbsp;</p>

<pre>
| seat_id |
|---------|
| 3       |
| 4       |
| 5       |
</pre>
<b>Note</b>:

<ul>
	<li>The seat_id is an auto increment int, and free is bool (&#39;1&#39; means free, and &#39;0&#39; means occupied.).</li>
	<li>Consecutive available seats are more than 2(inclusive) seats consecutively available.</li>
</ul>

In [1]:
import sqlalchemy
import pandas as pd
engine = sqlalchemy.create_engine('mysql+mysqlconnector://root:newpass_1234@localhost:3306/sys')

In [2]:
pd.read_sql_table("cinema", engine)

   seat_id  free
0        1     1
1        2     0
2        3     1
3        4     1
4        5     1

In [10]:
## Method 1: Parallel
query = '''
SELECT DISTINCT c1.seat_id
FROM cinema c1, cinema c2
WHERE c1.free = 1 AND c2.free = 1
AND ABS(c1.seat_id - c2.seat_id) = 1;
'''
pd.read_sql_query(query, engine)

   seat_id
0        4
1        3
2        5

In [12]:
## Method 2: INNER JOIN
query = '''
SELECT DISTINCT c1.seat_id
FROM cinema c1
INNER JOIN cinema c2
ON ABS(c1.seat_id - c2.seat_id) = 1
WHERE c1.free = 1 AND c2.free = 1
ORDER BY c1.seat_id;
'''
pd.read_sql_query(query, engine)

   seat_id
0        3
1        4
2        5